Revit 2026 API

# AnalysisDisplayStyleVectorArrowheadScale Enumeration

---

Defines arrow head scaling for vector settings of analysis display style.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum AnalysisDisplayStyleVectorArrowheadScale
```
```vb
Public Enumeration AnalysisDisplayStyleVectorArrowheadScale
```
```cpp
public enum class AnalysisDisplayStyleVectorArrowheadScale
```
```fsharp
type AnalysisDisplayStyleVectorArrowheadScale
```

| Member name | Value | Description |
| --- | --- | --- |
| Length10Percent | 2 |  |
| Length15Percent | 3 |  |
| Length20Percent | 4 |  |
| Length5Percent | 1 |  |
| NoArrow | 5 |  |
| NoScaling | 0 |  |

#### Reference

Autodesk.Revit.DB.Analysis Namespace